BCPH357/stm32n6_rppg/stm32_rppg/Appli/Drivers/BSP/Components/imx335/imx335.c
/**
  ******************************************************************************
  * @file    imx335.c
  * @author  MCD Application Team
  * @brief   This file provides the IMX335 camera driver
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "imx335.h"
#include <string.h>
#include "stm32n6xx_hal.h"


/** @addtogroup BSP
  * @{
  */

/** @addtogroup Components
  * @{
  */

/** @addtogroup IMX335
  * @brief     This file provides a set of functions needed to drive the
  *            IMX335 Camera module.
  * @{
  */

/** @defgroup IMX335_Private_TypesDefinitions Private Types definition
  * @{
  */
#define ARRAY_SIZE(arr) (sizeof(arr) / sizeof((arr)[0]))

/**
  * @}
  */

/** @defgroup IMX335_Private_Variables Private Variables
  * @{
  */
IMX335_CAMERA_Drv_t   IMX335_CAMERA_Driver =
{
  .Init = IMX335_Init,
  .DeInit = IMX335_DeInit,
  .ReadID = IMX335_ReadID,
  .GetCapabilities = IMX335_GetCapabilities,
  .SetGain = IMX335_SetGain,
  .SetExposure = IMX335_SetExposure,
  .SetFrequency = IMX335_SetFrequency,
  .MirrorFlipConfig = IMX335_MirrorFlipConfig,
  .GetSensorInfo = IMX335_GetSensorInfo,
  .SetTestPattern = IMX335_SetTestPattern
};
/**
  * @}
  */

/** @defgroup IMX335_Private_Constants Private Constants
  * @{
  */
struct regval {
  uint16_t addr;
  uint8_t val;
};

static const struct regval res_2592_1944_regs[] = {
  {0x3000, 0x01},
  {0x3002, 0x00},
  {0x300c, 0x3b},
  {0x300d, 0x2a},
  {0x3018, 0x04},
  {0x302c, 0x3c},
  {0x302e, 0x20},
  {0x3056, 0x98},
  {0x3074, 0xc8},
  {0x3076, 0x30},
  {0x304c, 0x00},
  {0x314c, 0xc6},
  {0x315a, 0x02},
  {0x3168, 0xa0},
  {0x316a, 0x7e},
  {0x31a1, 0x00},
  {0x3288, 0x21},
  {0x328a, 0x02},
  {0x3414, 0x05},
  {0x3416, 0x18},
  {0x3648, 0x01},
  {0x364a, 0x04},
  {0x364c, 0x04},
  {0x3678, 0x01},
  {0x367c, 0x31},
  {0x367e, 0x31},
  {0x3706, 0x10},
  {0x3708, 0x03},
  {0x3714, 0x02},
  {0x3715, 0x02},
  {0x3716, 0x01},
  {0x3717, 0x03},
  {0x371c, 0x3d},
  {0x371d, 0x3f},
  {0x372c, 0x00},
  {0x372d, 0x00},
  {0x372e, 0x46},
  {0x372f, 0x00},
  {0x3730, 0x89},
  {0x3731, 0x00},
  {0x3732, 0x08},
  {0x3733, 0x01},
  {0x3734, 0xfe},
  {0x3735, 0x05},
  {0x3740, 0x02},
  {0x375d, 0x00},
  {0x375e, 0x00},
  {0x375f, 0x11},
  {0x3760, 0x01},
  {0x3768, 0x1b},
  {0x3769, 0x1b},
  {0x376a, 0x1b},
  {0x376b, 0x1b},
  {0x376c, 0x1a},
  {0x376d, 0x17},
  {0x376e, 0x0f},
  {0x3776, 0x00},
  {0x3777, 0x00},
  {0x3778, 0x46},
  {0x3779, 0x00},
  {0x377a, 0x89},
  {0x377b, 0x00},
  {0x377c, 0x08},
  {0x377d, 0x01},
  {0x377e, 0x23},
  {0x377f, 0x02},
  {0x3780, 0xd9},
  {0x3781, 0x03},
  {0x3782, 0xf5},
  {0x3783, 0x06},
  {0x3784, 0xa5},
  {0x3788, 0x0f},
  {0x378a, 0xd9},
  {0x378b, 0x03},
  {0x378c, 0xeb},
  {0x378d, 0x05},
  {0x378e, 0x87},
  {0x378f, 0x06},
  {0x3790, 0xf5},
  {0x3792, 0x43},
  {0x3794, 0x7a},
  {0x3796, 0xa1},
  {0x37b0, 0x36},
  {0x3a00, 0x01},
};

static const struct regval mode_2l_10b_regs[] = {
  {0x3050, 0x00},
  {0x319D, 0x00},
  {0x341c, 0xff},
  {0x341d, 0x01},
  {0x3a01, 0x01},
};

static const struct regval inck_74Mhz_regs[] = {
  {0x300c, 0xB6},
  {0x300d, 0x7F},
  {0x314c, 0x80},
  {0x314d, 0x00},
  {0x315a, 0x03},
  {0x3168, 0x68},
  {0x316a, 0x7F},
};

static const struct regval inck_27Mhz_regs[] = {
  {0x300c, 0x42},
  {0x300d, 0x2E},
  {0x314c, 0xB0},
  {0x314d, 0x00},
  {0x315a, 0x02},
  {0x3168, 0x8F},
  {0x316a, 0x7E},
};

static const struct regval inck_24Mhz_regs[] = {
  {0x300c, 0x3B},
  {0x300d, 0x2A},
  {0x314c, 0xC6},
  {0x314d, 0x00},
  {0x315a, 0x02},
  {0x3168, 0xA0},
  {0x316a, 0x7E},
};

static const struct regval inck_18Mhz_regs[] = {
  {0x300c, 0x2D},
  {0x300d, 0x1F},
  {0x314c, 0x84},
  {0x314d, 0x00},
  {0x315a, 0x01},
  {0x3168, 0x6B},
  {0x316a, 0x7D},
};

static const struct regval inck_6Mhz_regs[] = {
  {0x300c, 0x0F},
  {0x300d, 0x0B},
  {0x314c, 0xC6},
  {0x314d, 0x00},
  {0x315a, 0x00},
  {0x3168, 0xA0},
  {0x316a, 0x7C},
};

static const struct regval framerate_10fps_regs[] = {
  {0x3030, 0xC0},
  {0x3031, 0x34},
};

static const struct regval framerate_15fps_regs[] = {
  {0x3030, 0x2A},
  {0x3031, 0x23},
};

static const struct regval framerate_20fps_regs[] = {
  {0x3030, 0x60},
  {0x3031, 0x1A},
};

static const struct regval framerate_25fps_regs[] = {
  {0x3030, 0x1A},
  {0x3031, 0x15},
};

static const struct regval framerate_30fps_regs[] = {
  {0x3030, 0x94},
  {0x3031, 0x11},
};

static const struct regval mirrorflip_mode_regs[][10] = {
  {
    {AREA3_ST_ADR_1_LSB, 0xc8}, //AREA3_ST_ADR_1 LSB
    {AREA3_ST_ADR_1_MSB, 0x00}, //AREA3_ST_ADR_1 MSB
    {IMX335_REG_HREVERSE, 0x00}, //HREVERSE 0
    {IMX335_REG_VREVERSE, 0x00}, //VREVERSE 0
    {0x3081, 0x02}, //RESERVED
    {0x3083, 0x02}, //RESERVED
    {0x30b6, 0x00}, //RESERVED
    {0x30b7, 0x00}, //RESERVED
    {0x3116, 0x08}, //RESERVED
    {0x3117, 0x00}, //RESERVED
  },
  {
    {AREA3_ST_ADR_1_LSB, 0xf8}, //AREA3_ST_ADR_1 LSB
    {AREA3_ST_ADR_1_MSB, 0x0f}, //AREA3_ST_ADR_1 MSB
    {IMX335_REG_HREVERSE, 0x00}, //HREVERSE 0
    {IMX335_REG_VREVERSE, 0x01}, //VREVERSE 1
    {0x3081, 0xfe}, //RESERVED
    {0x3083, 0xfe}, //RESERVED
    {0x30b6, 0xfa}, //RESERVED
    {0x30b7, 0x01}, //RESERVED
    {0x3116, 0x02}, //RESERVED
    {0x3117, 0x00}, //RESERVED
  },
  {
    {AREA3_ST_ADR_1_LSB, 0xc8}, //AREA3_ST_ADR_1 LSB
    {AREA3_ST_ADR_1_MSB, 0x00}, //AREA3_ST_ADR_1 MSB
    {IMX335_REG_HREVERSE, 0x01}, //HREVERSE 1
    {IMX335_REG_VREVERSE, 0x00}, //VREVERSE 0
    {0x3081, 0x02}, //RESERVED
    {0x3083, 0x02}, //RESERVED
    {0x30b6, 0x00}, //RESERVED
    {0x30b7, 0x00}, //RESERVED
    {0x3116, 0x08}, //RESERVED
    {0x3117, 0x00}, //RESERVED
  },
  {
    {AREA3_ST_ADR_1_LSB, 0xf8}, //AREA3_ST_ADR_1 LSB
    {AREA3_ST_ADR_1_MSB, 0x0f}, //AREA3_ST_ADR_1 MSB
    {IMX335_REG_HREVERSE, 0x01}, //HREVERSE 1
    {IMX335_REG_VREVERSE, 0x01}, //VREVERSE 1
    {0x3081, 0xfe}, //RESERVED
    {0x3083, 0xfe}, //RESERVED
    {0x30b6, 0xfa}, //RESERVED
    {0x30b7, 0x01}, //RESERVED
    {0x3116, 0x02}, //RESERVED
    {0x3117, 0x00}, //RESERVED
  },
};

