BCPH357/stm32n6_rppg/stm32_rppg/Appli/Drivers/BSP/Components/imx335/imx335.c
static const struct regval test_pattern_enable_regs[] = {
  {0x3148, 0x10},
  {0x3280, 0x00},
  {0x329c, 0x01},
  {0x32a0, 0x11},
  {0x3302, 0x00},
  {0x3303, 0x00},
  {0x336c, 0x00},
};

static const struct regval test_pattern_disable_regs[] = {
  {0x3148, 0x00},
  {0x3280, 0x01},
  {0x329c, 0x00},
  {0x32a0, 0x10},
  {0x3302, 0x32},
  {0x3303, 0x00},
  {0x336c, 0x01},
};

#define IMX335_1H_PERIOD_USEC (1000000.0F / 4500 / 30)

/**
  * @}
  */

/** @defgroup IMX335_Private_Functions_Prototypes Private Functions Prototypes
  * @{
  */
static int32_t IMX335_WriteTable(IMX335_Object_t *pObj, const struct regval *regs, uint32_t size);
static int32_t IMX335_ReadRegWrap(void *handle, uint16_t Reg, uint8_t* Data, uint16_t Length);
static int32_t IMX335_WriteRegWrap(void *handle, uint16_t Reg, uint8_t* Data, uint16_t Length);
static int32_t IMX335_Delay(IMX335_Object_t *pObj, uint32_t Delay);

/**
  * @}
  */

/** @defgroup IMX335_Private_Functions Private Functions
  * @{
  */
static int32_t IMX335_WriteTable(IMX335_Object_t *pObj, const struct regval *regs, uint32_t size)
{
  uint32_t index;
  int32_t ret = IMX335_OK;

  printf("[IMX335_WriteTable] Writing %lu registers...\r\n", size);
  if(size > 0) {
    printf("[IMX335_WriteTable] First reg: addr=0x%04X, val=0x%02X\r\n", regs[0].addr, regs[0].val);
  }

  /* Set registers */
  for(index=0; index<size ; index++)
  {
    if(ret != IMX335_ERROR)
    {
      if(imx335_write_reg(&pObj->Ctx, regs[index].addr, (uint8_t *)&(regs[index].val), 1) != IMX335_OK)
      {
        printf("[IMX335_WriteTable] ERROR at index %lu: addr=0x%04X, val=0x%02X\r\n",
               index, regs[index].addr, regs[index].val);
        ret = IMX335_ERROR;
      }
    }
  }

  if(ret == IMX335_OK) {
    if(size > 0) {
      printf("[IMX335_WriteTable] Last reg: addr=0x%04X, val=0x%02X\r\n",
             regs[size-1].addr, regs[size-1].val);
    }
    printf("[IMX335_WriteTable] All %lu registers written successfully\r\n", size);
  } else {
    printf("[IMX335_WriteTable] FAILED: stopped at index %lu/%lu\r\n", index, size);
  }

  return ret;
}

/**
  * @brief This function provides accurate delay (in milliseconds)
  * @param pObj   pointer to component object
  * @param Delay  specifies the delay time length, in milliseconds
  * @retval IMX335_OK
  */
static int32_t IMX335_Delay(IMX335_Object_t *pObj, uint32_t Delay)
{
  /* Use tick-based delay (same as official implementation) */
  uint32_t tickstart = pObj->IO.GetTick();
  while ((pObj->IO.GetTick() - tickstart) < Delay)
  {
    /* Wait */
  }
  return IMX335_OK;
}

/**
  * @brief  Wrap component ReadReg to Bus Read function
  * @param  handle  Component object handle
  * @param  Reg  The target register address to write
  * @param  pData  The target register value to be written
  * @param  Length  buffer size to be written
  * @retval error status
  */
static int32_t IMX335_ReadRegWrap(void *handle, uint16_t Reg, uint8_t* pData, uint16_t Length)
{
  IMX335_Object_t *pObj = (IMX335_Object_t *)handle;

  return pObj->IO.ReadReg(pObj->IO.Address, Reg, pData, Length);
}

/**
  * @brief  Wrap component WriteReg to Bus Write function
  * @param  handle  Component object handle
  * @param  Reg  The target register address to write
  * @param  pData  The target register value to be written
  * @param  Length  buffer size to be written
  * @retval error status
  */
static int32_t IMX335_WriteRegWrap(void *handle, uint16_t Reg, uint8_t* pData, uint16_t Length)
{
  IMX335_Object_t *pObj = (IMX335_Object_t *)handle;

  return pObj->IO.WriteReg(pObj->IO.Address, Reg, pData, Length);
}

/**
  * @}
  */

/** @defgroup IMX335_Exported_Functions IMX335 Exported Functions
  * @{
  */
/**
  * @brief  Register component IO bus
  * @param  Component object pointer
  * @retval Component status
  */
int32_t IMX335_RegisterBusIO(IMX335_Object_t *pObj, IMX335_IO_t *pIO)
{
  int32_t ret;

  if (pObj == NULL)
  {
    ret = IMX335_ERROR;
  }
  else
  {
    pObj->IO.Init      = pIO->Init;
    pObj->IO.DeInit    = pIO->DeInit;
    pObj->IO.Address   = pIO->Address;
    pObj->IO.WriteReg  = pIO->WriteReg;
    pObj->IO.ReadReg   = pIO->ReadReg;
    pObj->IO.GetTick   = pIO->GetTick;

    pObj->Ctx.ReadReg  = IMX335_ReadRegWrap;
    pObj->Ctx.WriteReg = IMX335_WriteRegWrap;
    pObj->Ctx.handle   = pObj;

    if(pObj->IO.Init != NULL)
    {
      ret = pObj->IO.Init();
    }
    else
    {
      ret = IMX335_ERROR;
    }
  }

  return ret;
}

/**
  * @brief  Initializes the IMX335 CAMERA component.
  * @param  pObj  pointer to component object
  * @param  Resolution  Camera resolution
  * @param  PixelFormat pixel format to be configured
  * @retval Component status
  */
int32_t IMX335_Init(IMX335_Object_t *pObj, uint32_t Resolution, uint32_t PixelFormat)
{

  int32_t ret = IMX335_OK;
  uint8_t tmp;

  printf("[IMX335_Init] Entry: Resolution=%lu, PixelFormat=%lu\r\n", Resolution, PixelFormat);
  printf("[IMX335_Init] pObj->IsInitialized = %u\r\n", pObj->IsInitialized);

  if(pObj->IsInitialized == 0U)
  {
    printf("[IMX335_Init] Starting initialization...\r\n");
    switch (Resolution)
    {
      case IMX335_R2592_1944:
        printf("[IMX335_Init] Writing resolution regs (count=%u)...\r\n", ARRAY_SIZE(res_2592_1944_regs));
        if(IMX335_WriteTable(pObj, res_2592_1944_regs, ARRAY_SIZE(res_2592_1944_regs)) != IMX335_OK)
        {
          printf("[IMX335_Init] ERROR: WriteTable failed for resolution regs\r\n");
          ret = IMX335_ERROR;
        }
        else
        {
          printf("[IMX335_Init] Resolution regs written successfully\r\n");
        }
        break;
      /* Add new resolution here */
      default:
        /* Resolution not supported */
        ret = IMX335_ERROR;
    }

//    if(!ret)
//    {
//      printf("[IMX335_Init] Writing mode regs (count=%u)...\r\n", ARRAY_SIZE(mode_2l_10b_regs));
//      if(IMX335_WriteTable(pObj, mode_2l_10b_regs, ARRAY_SIZE(mode_2l_10b_regs)) != IMX335_OK)
//      {
//        printf("[IMX335_Init] ERROR: WriteTable failed for mode regs\r\n");
//        ret = IMX335_ERROR;
//      }
//      else
//      {
//        printf("[IMX335_Init] Mode regs written successfully\r\n");
//        /* Start streaming */
//        tmp = IMX335_MODE_STREAMING;
//        printf("[IMX335_Init] Writing MODE_SELECT reg (0x%04X) = 0x%02X...\r\n", IMX335_REG_MODE_SELECT, tmp);
//        if(imx335_write_reg(&pObj->Ctx, IMX335_REG_MODE_SELECT, &tmp, 1) != IMX335_OK)
//        {
//          printf("[IMX335_Init] ERROR: write_reg failed for MODE_SELECT\r\n");
//          ret = IMX335_ERROR;
//        }
//        else
//        {
//          /* NO PRINTF after MODE_SELECT - UART may be blocked */
//          IMX335_Delay(pObj, 20);
//          pObj->IsInitialized = 1U;
//          /* Streaming started, initialization complete */
//        }
//      }
//    }
//    else
//    {
//      printf("[IMX335_Init] ERROR: ret=%ld after resolution config\r\n", ret);
//    }
    if (!ret)
    {
        printf("[IMX335_Init] Writing mode regs (count=%u)...\r\n", ARRAY_SIZE(mode_2l_10b_regs));

