BCPH357/stm32n6_rppg/stm32_rppg/Appli/Drivers/BSP/Components/imx335/imx335.c
        if (IMX335_WriteTable(pObj, mode_2l_10b_regs, ARRAY_SIZE(mode_2l_10b_regs)) != IMX335_OK)
        {
            printf("[IMX335_Init] ERROR: WriteTable failed for mode regs\r\n");
            ret = IMX335_ERROR;
        }
        else
        {
            printf("[IMX335_Init] Mode regs written successfully\r\n");

            /* Start streaming (same as official DCMIPP_ContinuousMode) */
            tmp = IMX335_MODE_STREAMING;
            printf("[IMX335_Init] Writing MODE_SELECT reg (0x%04X) = 0x%02X...\r\n",
                   IMX335_REG_MODE_SELECT, tmp);
            if (imx335_write_reg(&pObj->Ctx, IMX335_REG_MODE_SELECT, &tmp, 1) != IMX335_OK)
            {
                printf("[IMX335_Init] ERROR: write_reg failed for MODE_SELECT\r\n");
                ret = IMX335_ERROR;
            }
            else
            {
                printf("[IMX335_Init] MODE_SELECT written, delaying 20ms...\r\n");
                IMX335_Delay(pObj, 20);
                pObj->IsInitialized = 1U;
                printf("[IMX335_Init] Initialization complete! Streaming ON\r\n");
            }
        }
    }
    else
    {
        printf("[IMX335_Init] ERROR: ret=%ld after resolution config\r\n", ret);
    }

  }
  else
  {
    printf("[IMX335_Init] Already initialized, skipping\r\n");
  }

  printf("[IMX335_Init] Exit: ret=%ld\r\n", ret);
  return ret;
}

int32_t IMX335_StartStreaming(IMX335_Object_t *pObj)
{
    uint8_t tmp = IMX335_MODE_STREAMING;
    printf("[IMX335_StartStreaming] Writing MODE_SELECT=0x00 (streaming ON)...\r\n");

    if (imx335_write_reg(&pObj->Ctx, IMX335_REG_MODE_SELECT, &tmp, 1) != IMX335_OK)
    {
        printf("[IMX335_StartStreaming] ERROR: write_reg failed!\r\n");
        return IMX335_ERROR;
    }

    HAL_Delay(20);
    printf("[IMX335_StartStreaming] Sensor is now streaming.\r\n");
    return IMX335_OK;
}

/**
  * @brief  De-initializes the camera sensor.
  * @param  pObj  pointer to component object
  * @retval Component status
  */
int32_t IMX335_DeInit(IMX335_Object_t *pObj)
{
  if(pObj->IsInitialized == 1U)
  {
    /* De-initialize camera sensor interface */
    pObj->IsInitialized = 0U;
  }

  return IMX335_OK;
}

/**
  * @brief  Read the IMX335 Camera identity.
  * @param  pObj  pointer to component object
  * @param  Id    pointer to component ID
  * @retval Component status
  */
int32_t IMX335_ReadID(IMX335_Object_t *pObj, uint32_t *Id)
{
  int32_t ret;
  uint8_t tmp;

  /* Initialize I2C */
  pObj->IO.Init();

  if(imx335_read_reg(&pObj->Ctx, IMX335_REG_ID, &tmp, 1)!= IMX335_OK)
  {
    ret = IMX335_ERROR;
  }
  else
  {
    *Id = tmp;
    ret = IMX335_OK;
  }

  /* Component status */
  return ret;
}

/**
  * @brief  Read the IMX335 Camera Capabilities.
  * @param  pObj          pointer to component object
  * @param  Capabilities  pointer to component Capabilities
  * @retval Component status
  */
int32_t IMX335_GetCapabilities(IMX335_Object_t *pObj, IMX335_Capabilities_t *Capabilities)
{
  int32_t ret;

  if(pObj == NULL)
  {
    ret = IMX335_ERROR;
  }
  else
  {
    Capabilities->Config_Brightness    = 0;
    Capabilities->Config_Contrast      = 0;
    Capabilities->Config_HueDegree     = 0;
    Capabilities->Config_Gain          = 1;
    Capabilities->Config_Exposure      = 1;
    Capabilities->Config_ExposureMode  = 0;
    Capabilities->Config_LightMode     = 0;
    Capabilities->Config_MirrorFlip    = 1;
    Capabilities->Config_NightMode     = 0;
    Capabilities->Config_Resolution    = 0;
    Capabilities->Config_Saturation    = 0;
    Capabilities->Config_SpecialEffect = 0;
    Capabilities->Config_Zoom          = 0;
    Capabilities->Config_SensorInfo    = 1;
    Capabilities->Config_TestPattern   = 1;

    ret = IMX335_OK;
  }

  return ret;
}

/**
  * @brief  Get the IMX335 Sensor info.
  * @param  pObj   pointer to component object
  * @param  Info   pointer to sensor info
  * @retval Component status
  */
int32_t IMX335_GetSensorInfo(IMX335_Object_t *pObj, IMX335_SensorInfo_t *Info)
{
  if ((!pObj) || (Info == NULL))
  {
    return IMX335_ERROR;
  }

  if (sizeof(Info->name) >= strlen(IMX335_NAME) + 1)
  {
    strcpy(Info->name, IMX335_NAME);
  }
  else
  {
    return IMX335_ERROR;
  }

  Info->bayer_pattern = IMX335_BAYER_PATTERN;
  Info->color_depth = IMX335_COLOR_DEPTH;
  Info->width = IMX335_WIDTH;
  Info->height = IMX335_HEIGHT;
  Info->gain_min = IMX335_GAIN_MIN;
  Info->gain_max = IMX335_GAIN_MAX;
  Info->exposure_min = IMX335_EXPOSURE_MIN;
  Info->exposure_max = IMX335_EXPOSURE_MAX;

  return IMX335_OK;
}

/**
  * @brief  Set the gain
  * @param  pObj  pointer to component object
  * @param  Gain Gain in mdB
  * @retval Component status
  */
int32_t IMX335_SetGain(IMX335_Object_t *pObj, int32_t gain)
{
  int32_t ret = IMX335_OK;
  uint8_t hold;

  if ((gain > IMX335_GAIN_MAX) || (gain < IMX335_GAIN_MIN))
  {
    ret = IMX335_ERROR;
  }
  else
  {
    /* Convert to IMX335 gain unit (0.3 dB = 300 mdB) */
    gain /= IMX335_GAIN_UNIT_MDB;

    hold = 1;
    if(imx335_write_reg(&pObj->Ctx, IMX335_REG_HOLD, &hold, 1) != IMX335_OK)
    {
      ret = IMX335_ERROR;
    }
    else
    {
      if(imx335_write_reg(&pObj->Ctx, IMX335_REG_GAIN, (uint8_t *)&gain, 2) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      else
      {
        hold = 0;
        if(imx335_write_reg(&pObj->Ctx, IMX335_REG_HOLD, &hold, 1) != IMX335_OK)
        {
          ret = IMX335_ERROR;
        }
      }
    }
  }

return ret;
}

/**
  * @brief  Set the exposure
  * @param  pObj  pointer to component object
  * @param  Exposure Exposure in micro seconds
  * @retval Component status
  */
int32_t IMX335_SetExposure(IMX335_Object_t *pObj, int32_t exposure)
{
  int32_t ret = IMX335_OK;
  uint32_t vmax, shutter;
  uint8_t hold;


  if (imx335_read_reg(&pObj->Ctx, IMX335_REG_VMAX, (uint8_t *)&vmax, 4) != IMX335_OK)
  {
    ret = IMX335_ERROR;
  }
  else
  {
    shutter = ( vmax - (exposure /((uint32_t) IMX335_1H_PERIOD_USEC)));

    if (shutter < IMX335_SHUTTER_MIN)
    {
      ret = IMX335_ERROR;
    }
    else
    {
      hold = 1;
      if(imx335_write_reg(&pObj->Ctx, IMX335_REG_HOLD, &hold, 1) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      else
      {
        if(imx335_write_reg(&pObj->Ctx, IMX335_REG_SHUTTER, (uint8_t *)&shutter, 3) != IMX335_OK)
        {
          ret = IMX335_ERROR;
        }
        else
        {
          hold = 0;
          if(imx335_write_reg(&pObj->Ctx, IMX335_REG_HOLD, &hold, 1) != IMX335_OK)
          {
            ret = IMX335_ERROR;
          }
        }
      }
    }
  }

  return ret;
}

/**
  * @brief  Set the Frequency
  * @param  pObj  pointer to component object
  * @param  frequency in Mhz
  * @retval Component status
  */
int32_t IMX335_SetFrequency(IMX335_Object_t *pObj, int32_t frequency)
{
  uint32_t ret = IMX335_OK;

  switch (frequency)
  {
    case IMX335_INCK_74MHZ:
      if(IMX335_WriteTable(pObj, inck_74Mhz_regs, ARRAY_SIZE(inck_74Mhz_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    case IMX335_INCK_27MHZ:
      if(IMX335_WriteTable(pObj, inck_27Mhz_regs, ARRAY_SIZE(inck_27Mhz_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    case IMX335_INCK_24MHZ:
      if(IMX335_WriteTable(pObj, inck_24Mhz_regs, ARRAY_SIZE(inck_24Mhz_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    case IMX335_INCK_18MHZ:
      if(IMX335_WriteTable(pObj, inck_18Mhz_regs, ARRAY_SIZE(inck_18Mhz_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    default:
      /* IMX335_INCK_6MHZ */
      if(IMX335_WriteTable(pObj, inck_6Mhz_regs, ARRAY_SIZE(inck_6Mhz_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
  };

  return ret;
}

/**
  * @brief  Set the Framerate
  * @param  pObj  pointer to component object
  * @param  framerate 10, 15, 20, 25 or 30fps
  * @retval Component status
  */
int32_t IMX335_SetFramerate(IMX335_Object_t *pObj, int32_t framerate)
{
  uint32_t ret = IMX335_OK;
  switch (framerate)
  {
    case 10:
      if(IMX335_WriteTable(pObj, framerate_10fps_regs, ARRAY_SIZE(framerate_10fps_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    case 15:
      if(IMX335_WriteTable(pObj, framerate_15fps_regs, ARRAY_SIZE(framerate_15fps_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    case 20:
      if(IMX335_WriteTable(pObj, framerate_20fps_regs, ARRAY_SIZE(framerate_20fps_regs)) != IMX335_OK)
      {
       ret = IMX335_ERROR;
      }
      break;
    case 25:
      if(IMX335_WriteTable(pObj, framerate_25fps_regs, ARRAY_SIZE(framerate_25fps_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
    default:
      /* 30fps */
      if(IMX335_WriteTable(pObj, framerate_30fps_regs, ARRAY_SIZE(framerate_30fps_regs)) != IMX335_OK)
      {
        ret = IMX335_ERROR;
      }
      break;
  };

  return ret;
}

/**
  * @brief  Control imx335 camera mirror/vflip.
  * @param  pObj  pointer to component object
  * @param  Config To configure mirror, flip, both or none
  * @retval Component status
  */
int32_t IMX335_MirrorFlipConfig(IMX335_Object_t *pObj, uint32_t Config)
{
  int32_t ret = IMX335_OK;

