BCPH357/stm32n6_rppg/stm32_rppg/Appli/Drivers/BSP/Components/imx335/imx335.c
  switch (Config)
  {
    case IMX335_FLIP:
      ret = IMX335_WriteTable(pObj, mirrorflip_mode_regs[1], ARRAY_SIZE(mirrorflip_mode_regs[1]));
      break;
    case IMX335_MIRROR:
      ret = IMX335_WriteTable(pObj, mirrorflip_mode_regs[2], ARRAY_SIZE(mirrorflip_mode_regs[2]));
      break;
    case IMX335_MIRROR_FLIP:
      ret = IMX335_WriteTable(pObj, mirrorflip_mode_regs[3], ARRAY_SIZE(mirrorflip_mode_regs[3]));
      break;
    case IMX335_MIRROR_FLIP_NONE:
    default:
      ret = IMX335_WriteTable(pObj, mirrorflip_mode_regs[0], ARRAY_SIZE(mirrorflip_mode_regs[0]));
      break;
  }
  return ret;
}

/**
  * @brief  Set the Test Pattern Generator
  * @param  pObj  pointer to component object
  * @param  mode Pattern mode:
  *              -1 : Disable
  *               0 : All 000h
  *               1 : All FFFh
  *               2 : All 555h
  *               3 : All AAAh
  *               4 : Toggle 555/AAAh
  *               5 : Toggle AAA/555h
  *               6 : Toggle 000/555h
  *               7 : Toggle 555/000h
  *               8 : Toggle 000/FFFh
  *               9 : Toggle FFF/000h
  *               10: Horizontal color bars
  *               11: Vertical color bars
  * @retval Component status
  */
int32_t IMX335_SetTestPattern(IMX335_Object_t *pObj, int32_t mode)
{
  int32_t ret = IMX335_OK;
  uint8_t val;

  if (mode >= 0)
  {
    /* Enable Test Pattern #mode */
    val = mode;
    if (imx335_write_reg(&pObj->Ctx, IMX335_REG_TPG, &val, 1) != IMX335_OK)
    {
      return IMX335_ERROR;
    }
    if (IMX335_WriteTable(pObj, test_pattern_enable_regs, ARRAY_SIZE(test_pattern_enable_regs)) != IMX335_OK)
    {
      return IMX335_ERROR;
    }
  }
  else
  {
    /* Disable Test Pattern */
    if (IMX335_WriteTable(pObj, test_pattern_disable_regs, ARRAY_SIZE(test_pattern_disable_regs)) != IMX335_OK)
    {
      return IMX335_ERROR;
    }
  }

  return ret;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
